* Provides efficient implementation of dataframes
* dataframes - row & col structure of data.
* Different col can be of different datatype
* each col will be of same data type

* Series & DataFrames

In [1]:
import pandas as pd

### Series
* 1-d array of indexed data

In [2]:
data = pd.Series([0.25,0.5,0.75,1.0])

In [3]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [7]:
data.keys()

RangeIndex(start=0, stop=4, step=1)

In [6]:
data.valid()

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [8]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [18]:
data = pd.Series([0.4212,0.5323,0.621212],index=['a','b','c'])

In [10]:
data

a    0.4
b    0.5
c    0.6
dtype: float64

In [11]:
data['a']

0.40000000000000002

In [12]:
import numpy as np

In [19]:
np.round(data,decimals=3)

a    0.421
b    0.532
c    0.621
dtype: float64

In [20]:
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

In [22]:
# Converting Dictionary to series object
s = pd.Series(population_dict)

In [23]:
s

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [24]:
s['Texas']

26448193

In [25]:
s['Illinois':'Texas']

Illinois    12882135
New York    19651127
Texas       26448193
dtype: int64

In [26]:
data = {2:'a',3:'b',4:'c'}

In [27]:
pd.Series(data,index=[3,4])

3    b
4    c
dtype: object

In [28]:
pd.Series(5,index=[100,200,300])

100    5
200    5
300    5
dtype: int64

### Pandas DataFrame Object

In [29]:
# Converting Dictionary to series object
population = pd.Series(population_dict)

In [46]:
area_dict = {'California': 423967, 'Florida': 170312, 'New York': 141297,  'Texas': 695662,
              'Illinois': 149995}
areas = pd.Series(area_dict)

In [47]:
population

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [48]:
areas

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

In [49]:
# Creating dataframe from series
df = pd.DataFrame({'population':population, 'area':areas})

In [50]:
df

              area  population
California  423967    38332521
Florida     170312    19552860
Illinois    149995    12882135
New York    141297    19651127
Texas       695662    26448193

In [51]:
df.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [52]:
df.columns

Index(['area', 'population'], dtype='object')

In [55]:
df[['area']]

              area
California  423967
Florida     170312
Illinois    149995
New York    141297
Texas       695662

In [58]:
pd.DataFrame(population,columns=['pop'])

                 pop
California  38332521
Florida     19552860
Illinois    12882135
New York    19651127
Texas       26448193

In [62]:
# list comprehension to create list of dictionary
data = [{'a':i, 'b':2*i} for i in range(10)]

In [60]:
pd.DataFrame(data)

   a   b
0  0   0
1  1   2
2  2   4
3  3   6
4  4   8
5  5  10
6  6  12
7  7  14
8  8  16
9  9  18

In [61]:
data

[{'a': 0, 'b': 0},
 {'a': 1, 'b': 2},
 {'a': 2, 'b': 4},
 {'a': 3, 'b': 6},
 {'a': 4, 'b': 8},
 {'a': 5, 'b': 10},
 {'a': 6, 'b': 12},
 {'a': 7, 'b': 14},
 {'a': 8, 'b': 16},
 {'a': 9, 'b': 18}]

In [65]:
# Convert multi-dimension numpy array to dataframe
pd.DataFrame(np.random.rand(3,2), columns=['abc','def'], index=['a','b','c'])

        abc       def
a  0.601453  0.636977
b  0.861963  0.414517
c  0.504740  0.708105

### Pandas's Index Object
* Index array is immutable

In [66]:
idx = pd.Index(['a','b','c'])

In [70]:
pd.DataFrame(np.random.randint(size=3,low=1,high=5),index=idx)

   0
a  1
b  3
c  1

In [72]:
#idx[0] = 'x'

### Data Indexing and Selection 
###### Data Selection in Series

In [73]:
import pandas as pd

In [76]:
data = pd.Series([0.25,0.5,0.75,1.0], index=['a','b','c','d'])

In [77]:
data['b']

0.5

In [78]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [81]:
'a' in data # only checks in the keys, not in datas

True

In [80]:
0.25 in data

False

In [83]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [84]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [85]:
data[0:2]

a    0.25
b    0.50
dtype: float64

In [86]:
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

### Indexers : loc, iloc & ix

In [87]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])

In [88]:
data[1]

'a'

#### loc
* loc attribute allows indexing & slicing by values

In [89]:
data.loc[1]

'a'

In [90]:
data.loc[1:3]

1    a
3    b
dtype: object

In [91]:
data

1    a
3    b
5    c
dtype: object

#### iloc
* Access values by index

In [92]:
data.iloc[0]

'a'

In [93]:
data.iloc[1:3]

3    b
5    c
dtype: object

#### Data Selection in DataFrame
##### DataFrame as a dictionary

In [94]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})

In [95]:
data = pd.DataFrame({'area':area, 'pop':pop})

In [96]:
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [97]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [98]:
data.area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [100]:
data['pop']

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: pop, dtype: int64

In [102]:
help(data.pop)

Help on method pop in module pandas.core.generic:

pop(item) method of pandas.core.frame.DataFrame instance
    Return item and drop from frame. Raise KeyError if not found.

In [114]:
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [115]:
data['density'] = data['pop'] / data['area']

In [116]:
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [117]:
data.pop('density')

California     90.413926
Florida       114.806121
Illinois       85.883763
New York      139.076746
Texas          38.018740
Name: density, dtype: float64

In [118]:
data

              area       pop
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [121]:
data['density'] = data['pop'] / data['area']

In [122]:
data

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [125]:
data.T # =Not changing data but returning changed content

           California       Florida      Illinois      New York         Texas
area     4.239670e+05  1.703120e+05  1.499950e+05  1.412970e+05  6.956620e+05
pop      3.833252e+07  1.955286e+07  1.288214e+07  1.965113e+07  2.644819e+07
density  9.041393e+01  1.148061e+02  8.588376e+01  1.390767e+02  3.801874e+01

In [126]:
data.values[0]

array([  4.23967000e+05,   3.83325210e+07,   9.04139261e+01])

In [128]:
data.iloc[3]

area       1.412970e+05
pop        1.965113e+07
density    1.390767e+02
Name: New York, dtype: float64

In [137]:
data.loc[:'Illinois', 'pop']

California    38332521
Florida       19552860
Illinois      12882135
Name: pop, dtype: int64

In [139]:
data.loc['Illinois', 'area']

149995.0

In [142]:
data.loc[data.density > 100, 'pop':'density']

               pop     density
Florida   19552860  114.806121
New York  19651127  139.076746

In [144]:
data.ix[:3] #use loc if possible or else move to iloc

              area       pop     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [146]:
data.iloc[0,2] = 90

In [147]:
data

              area       pop     density
California  423967  38332521   90.000000
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

#### Operation in Pandas

In [148]:
import numpy as np
rng = np.random.RandomState(seed=42)
B = pd.DataFrame(rng.randint(0,20,(2,2)), columns=list('AB'))

In [149]:
B

    A   B
0   6  19
1  14  10

In [150]:
A = pd.DataFrame(rng.randint(0,20,(3,3)), columns=list('BAC'))

In [151]:
A

    B   A   C
0   7   6  18
1  10  10   3
2   7   2   1

In [152]:
A + B

      A     B   C
0  12.0  26.0 NaN
1  24.0  20.0 NaN
2   NaN   NaN NaN

In [157]:
A.add(B, fill_value=np.sum(B.mean(axis=1)))

      A     B     C
0  12.0  26.0  42.5
1  24.0  20.0  27.5
2  26.5  31.5  25.5

In [156]:
B.mean(axis=1)

0    12.5
1    12.0
dtype: float64

### Handling Missing Data

In [158]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [161]:
df = df.dropna()

In [162]:
df

     0    1  2
1  2.0  3.0  5

In [163]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [164]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [166]:
df.dropna(axis='rows',thresh=3) # threahold is min num of non-null values

     0    1  2
1  2.0  3.0  5

In [168]:
df.fillna(0)

     0    1  2
0  1.0  0.0  2
1  2.0  3.0  5
2  0.0  4.0  6

In [169]:
df.fillna(method='ffill')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  2.0  4.0  6

In [172]:
df = df.fillna(method='bfill')

In [173]:
df.fillna(method='ffill')

     0    1  2
0  1.0  3.0  2
1  2.0  3.0  5
2  2.0  4.0  6

#### Hierarchical indexing